---
kind: property
id: P:Autodesk.Revit.DB.TextNode.BaseDirection
source: html/e737ea68-ae8b-92b5-87b5-1c1f7d5c51d9.htm
---
# Autodesk.Revit.DB.TextNode.BaseDirection Property

Direction of the base line of the text object in model space.

## Syntax (C#)
```csharp
public XYZ BaseDirection { get; }
```